_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 256, 256, 32)      896       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 256, 256, 32)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256, 256, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 64)      18496     
_________________________________________________________________
batch_normalization_1 (Batch (None, 128, 128, 64)      256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 128, 128, 64)      0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128, 128, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 64, 96)        55392     
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 64, 96)        384       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64, 64, 96)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 64, 64, 96)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 64, 64, 256)       221440    
_________________________________________________________________
batch_normalization_3 (Batch (None, 64, 64, 256)       1024      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 64, 64, 256)       0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 64, 64, 256)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
batch_normalization_4 (Batch (None, 64, 64, 256)       1024      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 64, 64, 256)       0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 64, 64, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
batch_normalization_5 (Batch (None, 64, 64, 256)       1024      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 64, 64, 256)       0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 64, 64, 256)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
batch_normalization_6 (Batch (None, 64, 64, 256)       1024      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 64, 64, 256)       0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 64, 64, 256)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1048576)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 1048577   
=================================================================
Total params: 3,119,777
Trainable params: 3,117,409
Non-trainable params: 2,368
_________________________________________________________________
