_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_2 (Dense)              (None, 8192)              827392    
_________________________________________________________________
reshape_1 (Reshape)          (None, 8, 8, 128)         0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 16, 16, 128)       147584    
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
activation_1 (Activation)    (None, 16, 16, 128)       0         
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 32, 32, 128)       0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 128)       147584    
_________________________________________________________________
batch_normalization_8 (Batch (None, 32, 32, 128)       512       
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 128)       0         
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 64, 64, 128)       147584    
_________________________________________________________________
batch_normalization_9 (Batch (None, 64, 64, 128)       512       
_________________________________________________________________
activation_3 (Activation)    (None, 64, 64, 128)       0         
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 128, 128, 128)     0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 128, 128, 128)     147584    
_________________________________________________________________
batch_normalization_10 (Batc (None, 128, 128, 128)     512       
_________________________________________________________________
activation_4 (Activation)    (None, 128, 128, 128)     0         
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 256, 256, 128)     0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 256, 256, 3)       3459      
_________________________________________________________________
activation_5 (Activation)    (None, 256, 256, 3)       0         
=================================================================
Total params: 1,423,235
Trainable params: 1,422,211
Non-trainable params: 1,024
_________________________________________________________________
